#pragma once
#include <iostream>
#include "SaveSystem.h"
#include "EndArt.h"
using namespace std;

//엔딩 화면 모음
void Ending1() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [해피엔딩:건강한 토마토]                                                                    " << endl;
    cout << "                                                                                                   " << endl;
    
    EndingArt1();

    cout << "                                                                                                   " << endl;
    cout << "       플레이어님! 집중력으로 모은 포인트로 당신의 뽀모도로가 잘 익은 토마토가 되었습니다!" << endl;
    cout << "       여기까지 오기까지 많은 유혹과 고난이 있었지만 잘 이겨낸 덕분에 과실까지 맺게 됐네요." << endl;
    cout << "       당신의 뽀모도로는 이제 당신의 손길이 없는 토마토의 세계로 떠납니다." << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;
}
void Ending2() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [씁쓸한 엔딩:설익은 토마토]                                                                 " << endl;
    cout << "                                                                                                   " << endl;

    EndingArt2();
  
    cout << "                                                                                                   " << endl;
    cout << "       플레이어님, 아쉽게도 과실이 맺히고 수확하기에는 덜 익었습니다.,, " << endl;
    cout << "       수분이 부족했나...? 아니면 벌레? 햇빛을 못 받았나? " << endl;
    cout << "       계속해서 부족한 부분이 생각날 수 있습니다. 하지만 다음 뽀모도로가 우리를 기다립니다." << endl;
    cout << "       후회하는 만큼 다시 한 번 더 당신 뽀모도로를 잘 키워봅시다!" << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;
}
void Ending3() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [배드엔딩:실패한 토마토]                                                                    " << endl;
    cout << "                                                                                                   " << endl;
    
    EndingArt3();

    cout << "                                                                                                   " << endl;
    cout << "       플레이어님. 당신의 뽀모도로가 과실을 맺지 못하고 대지로 돌아갔습니다." << endl;
    cout << "       무엇을 신경을 못 썼던 걸까요...?" << endl;
    cout << "       부족했던 점을 극복하고 다시 한 번 더 뽀모도로를 잘 길러주세요." << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;
}
void Ending4() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [케챱 엔딩:새콤달콤한 토마토]                                                               " << endl;
    cout << "                                                                                                   " << endl;
    EndingArt4();

    cout << "                                                                                                   " << endl;
    cout << "       플레이어님! 뽀모도로에게 준 설탕이 새로운 길을 개척하게 만들었습니다!" << endl;
    cout << "       설탕의 달콤함은 다른 평범한 토마토보다 맛이 좋았습니다." << endl;
    cout << "       그래서 당신의 뽀모도로는 케챱으로 만들어졌습니다. 맛있어보이네요." << endl;
    cout << "       또 다른 엔딩을 본 플레이어님 대단합니다!" << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;

}
void Ending5() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [멋쟁이 엔딩:슈퍼스타 토마토]                                                               " << endl;
    cout << "                                                                                                   " << endl;

    EndingArt5();

    cout << "                                                                                                   " << endl;
    cout << "       플레이어님! 당신의 뽀모도로는 둥글둥글 멋지몸매에 빨간옷을 입고 자라났습니다." << endl;
    cout << "       그리고 당신이 준 선글라스로 다른 토마토에 비해 한 눈에 이목을 사로잡습니다." << endl;
    cout << "       이런 소질을 타고난 뽀모도로는 토마토계의 슈퍼스타로 거듭나게 됩니다." << endl;
    cout << "       플레이어님 당신은 토마토에 스타를 만들어냈습니다!" << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;

}
void Ending6() {
    cout << "   =============================================================================================   " << endl;
    cout << "                                                                                                   " << endl;
    cout << "       [히든엔딩:최고의 토마토]                                                                    " << endl;
    cout << "                                                                                                   " << endl;
    
    EndingArt6();

    cout << "                                                                                                   " << endl;
    cout << "       플레이어님! 당신은 뽀모도로에게 해줄 수 있는 모든 최고의 육성을 해냈습니다!" << endl;
    cout << "       당신의 노력은 뽀모도로의 모습에서 왕관을 씌워줬습니다. " << endl;
    cout << "       토마토계의 두 번 다시 없을 최고의 토마토를 당신의 손을 키웠습니다." << endl;
    cout << "       플레이어님는 최고의 뽀모도로의 재배자입니다!" << endl;
    cout << "                                                                                                   " << endl;
    cout << "       SYSTEM: 엔터를 누를 시, 엔딩화면이 닫깁니다.                                                " << endl;
    cout << "                                                                                                   " << endl;
    cout << "   =============================================================================================   " << endl;

}



void ShowEnding(int endingNumber) {
    system("cls");

    //엔딩 화면 호출
    switch (endingNumber) {
    case 1:
        Ending1();
        
    case 2:
        Ending2();
        break;
    case 3:
        Ending3();
        break;

    case 4:
        Ending4();
        break;

    case 5:
        Ending5();
        break;

    case 6:
        Ending6();
        break;

    default:
        cout << "   SYSTEM: 존재하지 않는 엔딩입니다." << endl;
        break;
    }
    cin.ignore();
    cin.get();

}

void ShowAlbumMenu(PlayerData& data) {

    while (true) 
    {
        system("cls");
        cout << "   =============================================================================================   " << endl;
        cout << "                                                                                                   " << endl;
        cout << "       [ 엔딩 앨범 ]                                                                                   " << endl;
        cout << "                                                                                                   " << endl;
        cout << "                                1111111111111111111111111111111111111111111   " << endl;
        cout << "                              1111111111111111111111111111111111111111111111011" << endl;
        cout << "                                                                             101" << endl;
        cout << "                                                                              101" << endl;
        cout << "                     1110111111111111111111111111111111111111111111111011     101" << endl;
        cout << "                    101                                                101    101" << endl;
        cout << "                    10                                    11111         101   101" << endl;
        cout << "                    10                                 1101111111       101   101" << endl;
        cout << "                    10                                101      101      101   101" << endl;
        cout << "                    10                                101      101      101   101" << endl;
        cout << "                    10            1100011              101    1101      101   101" << endl;
        cout << "                    10          1111   1111             11011011        101   101" << endl;
        cout << "                    10        1111       1111                           101   101" << endl;
        cout << "                    10      1111           1111           11111         101   101" << endl;
        cout << "                    10    1111               1111       101111111       101   101" << endl;
        cout << "                    10  1111                   1111  11011     1111     101   101" << endl;
        cout << "                    101011                       110101          1101   101   101" << endl;
        cout << "                    1011                           1101            1101 101   101" << endl;
        cout << "                    10                               1101            110001   111" << endl;
        cout << "                    10                                  1              1101      " << endl;
        cout << "                    10                                                  101      " << endl;
        cout << "                    101                                                 101      " << endl;
        cout << "                     10111111111111111111111111111111111111111111111111101       " << endl;
        cout << "                      11111111111111111111111111111111111111111111111111         " << endl;
        cout << "                                                                                                   " << endl;
        cout << "                                                                                                   " << endl;
        cout << "                                                                                                   " << endl;
        cout << "   =============================================================================================   " << endl;
        cout << "                                                                                                   " << endl;
        cout << "       1. " << (data.endingSeen[0] ? "해피엔딩: 건강한 토마토" : "???") << endl;
        cout << "       2. " << (data.endingSeen[1] ? "씁쓸한 엔딩: 설익은 토마토" : "???") << endl;
        cout << "       3. " << (data.endingSeen[2] ? "배드엔딩: 실패한 토마토" : "???") << endl;
        cout << "       4. " << (data.endingSeen[3] ? "케챱 엔딩: 새콤달콤한 토마토" : "???") << endl;
        cout << "       5. " << (data.endingSeen[4] ? "멋쟁이 엔딩: 슈퍼스타 토마토" : "???") << endl;
        cout << "       6. " << (data.endingSeen[5] ? "히든 엔딩: 최고의 토마토" : "???") << endl;
        cout << "       0. 돌아가기" << endl;
        cout << "                                                                                                   " << endl;
        cout << "   =============================================================================================   " << endl;

        cout << "      조회할 엔딩 번호를 입력하세요: ";

        int n;  
        cin >> n;

        if (n == 0) 
        {
            system("cls");
            break; 
        }

        
        if (n < 1 || n > 6 || !data.endingSeen[n - 1]) 
        {
            cout << "      SYSTEM: 볼 수 없는 엔딩입니다. 엔터를 누르세요. ";
            cin.ignore();
            cin.get();
            continue;
        }
        ShowEnding(n);

    }
    
}

